artillery-test.yml
config:
  target: 'http://localhost:5000'
  phases:
    - duration: 600
      arrivalRate: 60
  environments:
    dev:
      target: 'http://api.devsummit.io:8081'
      phases:
        - duration: 1200
          arrivalRate: 20
    local:
      target: 'http://localhost:5000'
      phases:
      - duration: 180
        arrivalRate: 10
  defaults:
    headers:
      Authorization: 'eyJhbGciOiJIUzI1NiIsImlhdCI6MTUwNjUyMTU0NCwiZXhwIjoxNTA3MTI2MzQ0fQ.eyJpZCI6Mn0.MYJiqlykRf7OSq30GP9nWEl-ESPpWrqre3gkU76aQbU'
scenarios:
  - name: "Feed test"
    flow:
      - get:
          Content-Type: 'application/json'
          url: "/api/v1/feeds"
      - post:
          url: "/api/v1/feeds"
          formData:
            message: "Testing from arti"
  - name: "Order and payment test"
    flow:
      - get:
          headers: 
            Content-Type: 'application/json'
          url: "/api/v1/orders"
      - post:
          url: "/api/v1/orders"
          headers:
            Content-Type: 'application/json'
          json:
            order_details:
              - ticket_id: 1
                count: 4
          capture:
            json: $.data.id
            as: orderId
      - post:
          headers:
            Content-Type: 'application/json'
          url: '/api/v1/payments'
          json:
            payment_type: 'bca_klikbca'
            gross_amount: 1600000
            order_id: '{{ orderId }}'
            email: 'shi77.andy@gmail.com'
            first_name: 'andy'
            last_name: 'herman'
            phone: '089677777'
            description: 'testing via artillery'